// Приведення до булю на прикладі Boolean(value)
// До false приводиться 6 значень: 0, NaN, undefined, порожній рядок '', "", false. Все інше приводиться до true.
console.log(Boolean('g'));

// Логічний оператор І (оператор &&)
// Запинається на брехні
// Повертає те, на чому запнулось, або останній операнд
console.log(5 && 0 && 'j' && 7);


// Логічний оператор АБО ()
// Запинається на правді
// Повертає те, на чому запнулось, або останній операнд
console.log(null || 7 || 8 || 10);

// Логічний НІ (оператор !)
// Робить інверсію правда > брехня, брехня > правда
console.log(!false);
console.log(!1);

// Example
const x1 = 5;
const x2 = 30;
const number = 35;

console.log(`Число ${number} попадає у відрізок до ${x1}?`, number < x1);
console.log(`Число ${number} попадає у відрізок після ${x2}?`, number > x2);

console.log(`Число ${number} попадає у відрізок від ${x1} до ${x2}?`, number > x1 && number < x2);

console.log(`Число ${number} попадає у відрізок від ${x1} або до ${x2}?`, number > x1 || number < x2);